

判断 101-200 之间有多少个素数，并输出所有素数

打印出100-999中所有的“水仙花数”，所谓“水仙花数”是指一个三位数，其各位数字
立方和等于该数本身。例如：153 是一个“水仙花数”，因为 153=1 的三次
方＋5 的三次方＋3 的三次方


质数判断
水仙花数
字符统计
插入排序
选择排序
冒泡排序

数组求和

copy和cat命令简单实现



strings

判断一个url是否以http://开头，如果不是，则加上http://

判断一个路径是否以“/”结尾，如果不是，则加上/。

写一个函数返回一个字符串在另一个字符串的首次出现和最后出现位置

编写程序，在终端输出九九乘法表。

一个数如果恰好等于它的因子之和，这个数就称为“完数”。例如6=1＋2＋3.
编程找出1000以内的所有完数。
  

输入一个字符串，判断其是否为回文。回文字符串是指从左到右读和从右到
左读完全相同的字符串。

输入一个字符串，判断其是否为回文。回文字符串是指从左到右读和从右到
左读完全相同的字符串。


计算两个大数相加的和，这两个大数会超过int64的表示范围.

  



排序和查找操作
sort.Ints对整数进行排序， sort.Strings对字符串进行排序, sort.Float64s对浮点数进行排序.

冒泡
选择
插入
快排



链表
每个节点包含下一个节点的地址，这样把所有的节点串起来了，通常把
链表中的第一个节点叫做链表头


双链表定义
如果有两个指针分别指向前一个节点和后一个节点，我们叫做双链表

二叉树定义
如果每个节点有两个指针分别用来指向左子树和右子树，我们把这样的
结构叫做二叉树


实现一个通用的链表类


实现一个负载均衡调度算法，支持随机、轮训等算法







不同goroutine之间如何进行通讯？
a. 全局变量和锁同步
b. Channel



goroutine和channel相结合

channel阻塞
带缓冲区的channel
chan之间的同步

密码学


超时控制



go程序调试


go程序编译和Makefile



gofmt工具简介


godoc文档生成工具详解



正则表达式标准库介绍


锁与线程同步标准库介绍


第三方包开发与演练


安装和使用github上的第三方库


代码演练4：生产者与消费者问题

文件操作-创建


文件操作-读取


文件操作-写入


文件操作-拷贝


终端数据读取与命令行参数处理


文件操作-缓冲区


文件读写与slice


利用defer关闭文件

json数据格式


代码演练7：json与文件读写



启动外部命令和程序


GO中的单元测试与基准测试


Go程序的性能profile


cpu 与 内存pprof


在线pprof


代码演练8：错误处理实例




Go高并发模型


Lazy 生成器



多路复用介绍


并发数控制


代码演练9：并发实战



tcp服务代码实例


一个简单的web服务实例


web模板使用


模板语法详解


代码演练10：web服务开发


Go常见问题与陷阱



error陷阱



string陷阱


slice陷阱


指针与值类型陷阱


错误处理陷阱


代码演练11：常见问题实例


Go语言常见编程模式



实用代码片段


代码演练12：短url项目实战


Beego框架介绍



model逻辑


view编写


静态文件处理


配置读取


路由设置


代码演练13：Beego开发实例1


日志处理


数据输出


代码演练


ORM使用


CRUD操作


代码演练14：Beego开发实例2



秒杀系统之本质


秒杀系统之千万并发支撑



秒杀系统之架构设计


秒杀系统之长连接子系统设计


秒杀系统之Redis模块开发


秒杀系统之管理api设计


秒杀系统之管理api开发


秒杀系统之白名单开发


秒杀系统之放号模块设计


秒杀系统之放号策略开发


秒杀系统之系统整合


秒杀系统之过载保护


秒杀系统之性能优化


秒杀系统总结


海量日志系统简介


海量日志系统架构设计


海量日志系统之收集客户端设计


海量日志系统之收集限速模块开发


海量日志系统之kafka搭建


海量日志系统之ES（检索）搭建


海量日志系统之transfer模块设计



海量日志系统之系统整合


海量日志系统web管理平台搭建



海量日志系统之系统测试



海量日志系统总结