

判断 101-200 之间有多少个素数，并输出所有素数

打印出100-999中所有的“水仙花数”，所谓“水仙花数”是指一个三位数，其各位数字
立方和等于该数本身。例如：153 是一个“水仙花数”，因为 153=1 的三次
方＋5 的三次方＋3 的三次方


质数判断
水仙花数
字符统计
插入排序
选择排序
冒泡排序

数组求和

copy和cat命令简单实现



strings和strconv使用

判断一个url是否以http://开头，如果不是，则加上http://

判断一个路径是否以“/”结尾，如果不是，则加上/。

写一个函数返回一个字符串在另一个字符串的首次出现和最后出现位置

编写程序，在终端输出九九乘法表。

一个数如果恰好等于它的因子之和，这个数就称为“完数”。例如6=1＋2＋3.
编程找出1000以内的所有完数。
  

输入一个字符串，判断其是否为回文。回文字符串是指从左到右读和从右到
左读完全相同的字符串。

输入一个字符串，判断其是否为回文。回文字符串是指从左到右读和从右到
左读完全相同的字符串。


计算两个大数相加的和，这两个大数会超过int64的表示范围.

  



排序和查找操作
sort.Ints对整数进行排序， sort.Strings对字符串进行排序, sort.Float64s对浮点数进行排序.

冒泡
选择
插入
快排



链表
每个节点包含下一个节点的地址，这样把所有的节点串起来了，通常把
链表中的第一个节点叫做链表头


双链表定义
如果有两个指针分别指向前一个节点和后一个节点，我们叫做双链表

二叉树定义
如果每个节点有两个指针分别用来指向左子树和右子树，我们把这样的
结构叫做二叉树


实现一个通用的链表类


实现一个负载均衡调度算法，支持随机、轮训等算法







不同goroutine之间如何进行通讯？
a. 全局变量和锁同步
b. Channel



goroutine和channel相结合

channel阻塞
带缓冲区的channel
chan之间的同步


超时控制





单元测试





